; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	image1 - mode
	spectrograph3 - mode
	image4 - mode
	infrared5 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 spectrograph2)
	(supports instrument1 image4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument2 spectrograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph3)
	(supports instrument4 image4)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(have_image Star5 image1)
	(have_image Star5 spectrograph2)
	(have_image Star6 image1)
	(have_image Planet7 image4)
	(have_image Planet7 spectrograph2)
	(have_image Phenomenon8 image4)
	(have_image Planet9 spectrograph3)
	(have_image Planet9 infrared5)
	(have_image Phenomenon10 image4)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon11 infrared5)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 12
2. (calibrate satellite2 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 12
3. (turn_to satellite2 star6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star6)
   goals met: 0 of 12
4. (take_image satellite2 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 1 of 12
5. (turn_to satellite2 phenomenon11 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 12
6. (turn_to satellite1 star3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star3)
   goals met: 1 of 12
7. (turn_to satellite0 groundstation4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 12
8. (take_image satellite2 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 2 of 12
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
11. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 2 of 12
12. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 12
13. (turn_to satellite0 phenomenon11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 12
14. (take_image satellite0 phenomenon11 instrument0 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 3 of 12
15. (turn_to satellite0 planet9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet9)
   goals met: 3 of 12
16. (take_image satellite0 planet9 instrument0 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 4 of 12
17. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 12
18. (take_image satellite1 phenomenon10 instrument1 image4)
   added: (have_image phenomenon10 image4)
   goals met: 5 of 12
19. (take_image satellite1 phenomenon10 instrument1 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 6 of 12
20. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 6 of 12
21. (take_image satellite1 phenomenon8 instrument1 image4)
   added: (have_image phenomenon8 image4)
   goals met: 7 of 12
22. (turn_to satellite1 planet7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet7)
   goals met: 7 of 12
23. (take_image satellite1 planet7 instrument1 image4)
   added: (have_image planet7 image4)
   goals met: 8 of 12
24. (take_image satellite1 planet7 instrument1 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 9 of 12
25. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 9 of 12
26. (take_image satellite1 planet9 instrument1 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 10 of 12
27. (turn_to satellite2 star5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star5)
   goals met: 10 of 12
28. (take_image satellite2 star5 instrument2 image1)
   added: (have_image star5 image1)
   goals met: 11 of 12
29. (take_image satellite2 star5 instrument2 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 12 of 12
